In [1]:
# Initial imports
import pandas as pd
from pathlib import Path

In [2]:
# Load the NBA_Player.csv dataset.
file_path = "Database/New_CSV_Files/NBA_PLAYERDATA.csv"
df = pd.read_csv(file_path)
df.head(10)

       id            full_name first_name     last_name  is_active
0   76001       Alaa Abdelnaby       Alaa     Abdelnaby      False
1   76002      Zaid Abdul-Aziz       Zaid    Abdul-Aziz      False
2   76003  Kareem Abdul-Jabbar     Kareem  Abdul-Jabbar      False
3      51   Mahmoud Abdul-Rauf    Mahmoud    Abdul-Rauf      False
4    1505    Tariq Abdul-Wahad      Tariq   Abdul-Wahad      False
5     949  Shareef Abdur-Rahim    Shareef   Abdur-Rahim      False
6   76005        Tom Abernethy        Tom     Abernethy      False
7   76006          Forest Able     Forest          Able      False
8   76007       John Abramovic       John     Abramovic      False
9  203518         Alex Abrines       Alex       Abrines      False

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4501 entries, 0 to 4500
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id          4501 non-null   int64
 1   full_name   4501 non-null   object
 2   first_name  4495 non-null   object
 3   last_name   4501 non-null   object
 4   is_active   4501 non-null   bool
dtypes: bool(1), int64(1), object(3)
memory usage: 145.2+ KB

In [4]:
#Convert is_active column to 1's & 0's (False = 0 & True = 1)
df['is_active'] = (df['is_active'] == 'TRUE').astype(int)
df.head(5)

      id            full_name first_name     last_name  is_active
0  76001       Alaa Abdelnaby       Alaa     Abdelnaby          0
1  76002      Zaid Abdul-Aziz       Zaid    Abdul-Aziz          0
2  76003  Kareem Abdul-Jabbar     Kareem  Abdul-Jabbar          0
3     51   Mahmoud Abdul-Rauf    Mahmoud    Abdul-Rauf          0
4   1505    Tariq Abdul-Wahad      Tariq   Abdul-Wahad          0

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4501 entries, 0 to 4500
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id          4501 non-null   int64
 1   full_name   4501 non-null   object
 2   first_name  4495 non-null   object
 3   last_name   4501 non-null   object
 4   is_active   4501 non-null   int64
dtypes: int64(2), object(3)
memory usage: 175.9+ KB

In [6]:
#Check for NA Values
df.isna().sum()

id            0
full_name     0
first_name    6
last_name     0
is_active     0
dtype: int64

In [7]:
#Since there are only 6 NA values in the first_name column and none in any other column, we can drop the first_name and last name columns as these are duplicated in the full name column
df = df.drop(['first_name', 'last_name'], axis=1)
df.head()

      id            full_name  is_active
0  76001       Alaa Abdelnaby          0
1  76002      Zaid Abdul-Aziz          0
2  76003  Kareem Abdul-Jabbar          0
3     51   Mahmoud Abdul-Rauf          0
4   1505    Tariq Abdul-Wahad          0

In [8]:
#Check for duplicate values in id column
dups = df.pivot_table(index = ['id'], aggfunc ='size')
#No duplicate values
dups.describe()

count    4501.0
mean        1.0
std         0.0
min         1.0
25%         1.0
50%         1.0
75%         1.0
max         1.0
dtype: float64

In [9]:
#Save file to CSV
df.to_csv('Resources/playerdata_final.csv', index=True)